[
    {
        "title": "Five Chinese nationals among six killed in suicide bomb attack in Pakistan",
        "author": [
            "Abid Hussain"
        ],
        "text": "Attacker rams explosives-laden vehicle into convoy of Chinese engineers in Khyber Pakhtunkhwa hours after Baloch rebels attacked a naval base.\n\nIslamabad, Pakistan – Five Chinese nationals and a Pakistani driver have been killed after a suicide attacker rammed his explosive-laden vehicle into their convoy near Besham city in northwest Pakistan’s Khyber Pakhtunkhwa province.\n\nThe incident happened on Tuesday when the convoy was on its way from Islamabad to Dasu, the site of a key hydroelectric dam being constructed by a Chinese company, about 270km (167 miles) from the capital.\n\n“Our rescue team has successfully retrieved bodies of four people whereas recovery of two more people is still ongoing,” Bilal Faizi, spokesman for Rescue 1122 group in Khyber Pakhtunkhwa, told Al Jazeera.\n\nRescue officials said the vehicle carrying the Chinese nationals fell in a gorge after the blast and at least two bodies were badly burnt, making their identification difficult.\n\nNo armed group has so far claimed responsibility for the attack. The Chinese embassy in Islamabad or the Chinese foreign ministry in Beijing have not commented on the incident yet.\n\nChina is a close ally of Pakistan and has invested heavily in various projects in the South Asian country. But the safety of Chinese nationals working on those projects is often threatened by several armed groups in the region. In 2021, the bombing of a bus in Dasu killed 13 people, nine of them Chinese.\n\nDasu is about 80km (49 miles) further northwest from Besham where Tuesday’s suicide attack happened – the third such incident in a week.\n\nOn Monday night, separatist fighters attacked a naval airbase in Turbat area in the southwestern province of Balochistan, killing at least one paramilitary soldier. Officials said all five of the assailants were also killed in retaliatory fire.\n\nThe Baloch Liberation Army (BLA), which has been behind several attacks on Pakistani and Chinese interests in the region and elsewhere, claimed responsibility for the Turbat attack.\n\nLast week, another BLA attack at Gwadar, a port city in Balochistan, killed two soldiers and eight of the group’s fighters. Gwadar is the centrepiece of the $62bn dollar China-Pakistan Economic Corridor (CPEC) project, Pakistan’s most ambitious infrastructure and investment project in recent years.\n\nIn a statement, President Asif Ali Zardari condemned the attack on Chinese nationals. “Anti-Pakistani elements will never succeed in harming the Pakistan-China friendship,” he said.\n\nInterior Minister Mohsin Naqvi said “enemies” had targeted the citizens of Pakistan’s “extremely trusted friendly country”.\n\n“This was not an attack on Chinese citizens but also on Pakistan,” he said.\n\nPrime Minister Shehbaz Sharif, who assumed power for the second time earlier this month, is expected to visit China next month.",
        "images": 